#upper ადიდებს ყველა ასოს
#lower აპატარავებს ყველას ასოს
#capitalize პირველ ასოს ადიდებს დანარჩენს აპატარავებს
#find პოულობს იმ ასოს indexს რომელსაც მიუთითებ

#დოტ ნოტაციით შეგვიძლია სხვადასხვანაირად შევცვალოთ string ან list

#len თვლის რამდენი ასო ან ელემენტია
#insert სვამს რაიმე ელემენტს მინიშნულ ადგილს
#pop აგდებს მონიშნულ ელემენტს
#append ამატებს ელემენტს

# მეთოდი მიეკუთვნება ესე სიას ან სტრინგს ხოლო ჩაშენებული კი ცალკე იძახება
# მეთოდი არი ობიქტი.მეთოდი(ანუ appened ან ინსერტ)()
# ჩაშენებული კიდე ფუნქცია(არგუმენტი)