#index არის list ში ან რაიმე მსგავსში ელემენტის მიმდევრობა რომელიც იწყება 0ით

num = [45, 76, 65, 56, 87, 23, 89, 472, 547, 523,]
num[4] = 5
print(num[1:])

#slicing არი რაიმედან გამოყვანა ელემენტენების საიდანმე სადამდე

nuh_80_tooMuch = [85, 64, 55, 5, 3, 53, 52, 96, 77, 70, 32, 71, 40, 49, 19, 34, 2, 51, 75, 25, 
                  24, 21, 99, 84, 11, 17, 47, 73, 30, 16, 12, 88, 14, 41, 36, 22, 74, 8, 
                  37, 90, 92, 23, 50, 78, 10, 95, 80, 83, 44, 15, 68, 54, 82, 26, 9, 18, 48,
                  72, 100, 42, 33, 59, 66, 45, 97, 46, 56, 91, 63, 65, 20, 62, 43, 39, 67, 93, 76, 35, 29, 28]

nuh_80_tooMuch[64] = "gurami"
print(nuh_80_tooMuch[-16])