
age = input("გთხოვთ შეიყვანოთ თქვენი ასაკი: ")

print(age)

#input შეყვენა 
#output გამოყვანა



#სწორი იქნება

name6 = "gurami" #ცვლადის სახელი ვერ დაიწყება რიცხვით
print(name6) #დაგან ერთი ასო გამოსახულია uppercaset-თი მაშინ code აღიქვავს სხვა ცვლადის სახელად



age = int(input("შეიყვანეთ თქვენი ასაკი: "))
year = int(input("რომელი წელია ახლა: "))

print(age + 10)
print(year  + 10)

#snake_case აშორებს ორ სიტყვას ერთმანეთისგან _-თი 
#camelCase იყენებს uppercase ასოს რომ მიგვანიშნოს სად იწყება ახალი სიტყვა

#ცვადი ვერ დაიწყება რიცხვით და არ შეილება მასში იყოს +, -, *, /. ასევე space არ შეილება რომ მათ შორის ოყოს
#ცვლადი უნდა იწყებოდეს ასოთი, თუ გვინდა ორზე მეტი სიტყვისგან შედგებოდეს უნდა გამოვიყენოთ snake ან camel case
